app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    id = params[:id] # retrieve recipe ID from URI route
    @recipe = Recipe.find(id) rescue nil # Look up recipe by unique ID

INSERT INTO "recipes" ("apple", "beet", "carrot", "celery", "collardgreen", "created_at", "cucumber", "ginger", "grapefruit", "lemon", "lime", "mint", "orange", "pear", "pumpkinpiespice", "romaine", "spinach", "sweetpotato", "swisschard", "title", "tumericpowder", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @recipe = Recipe.create!(params[:recipe])

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @recipe = Recipe.find params[:id]

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "recipes" SET "beet" = 0, "carrot" = 0, "celery" = 0, "collardgreen" = 0, "ginger" = 0, "grapefruit" = 0, "lemon" = 0, "lime" = 0, "orange" = 0, "pumpkinpiespice" = 0, "romaine" = 0, "sweetpotato" = 0, "swisschard" = 0, "tumericpowder" = 0, "updated_at" = '2015-04-23 23:00:47.933636' WHERE "recipes"."id" = 1
---
  def update
    @recipe = Recipe.find params[:id]
    @recipe.update_attributes!(params[:recipe])

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = ? LIMIT 1  [["id", "5"]]
DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 5]]
---
  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.destroy

SELECT "recipes".* FROM "recipes" WHERE (id IN('2','3','4'))
---
  def selected_items
    @recipes = Recipe.where("id IN(?)", params[:items].split(','))